tests/data/responses/subscriptions.list.json

{
  "data": [
    {
      "id": "sub_Ab46Ko2y65xgEqM",
      "object": "subscription",
      "name": "Test Plan 2",
      "status": "active",
      "currency_code": "USDT",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDT",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 0.12,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667639001,
      "created_date": 1664960601,
      "deleted_date": null
    },
    {
      "id": "sub_x7vJaZ5mOD1EoY3",
      "object": "subscription",
      "name": "Test Plan 3",
      "status": "active",
      "currency_code": "USDT",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDT",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 0.13,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667639751,
      "created_date": 1664961351,
      "deleted_date": null
    },
    {
      "id": "sub_j40Lg2V00dAY3K1",
      "object": "subscription",
      "name": "Test Plan 6",
      "status": "active",
      "currency_code": "ETH",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "ETH",
        "blockchain": "ethereum",
        "coin_type": "native"
      },
      "fiat_amount": 0.21,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667779200,
      "created_date": 1665152735,
      "deleted_date": null
    },
    {
      "id": "sub_RW6n07dQedxqmpB",
      "object": "subscription",
      "name": "Test Plan",
      "status": "active",
      "currency_code": "USDT",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDT",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 0.1,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667634083,
      "created_date": 1664955683,
      "deleted_date": null
    },
    {
      "id": "sub_kb4ZV2wlV5YGvJ6",
      "object": "subscription",
      "name": "Test Plan 4",
      "status": "active",
      "currency_code": "USDT",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDT",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 0.14,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667606400,
      "created_date": 1664962020,
      "deleted_date": null
    },
    {
      "id": "sub_eqJ6VdWn65br4PE",
      "object": "subscription",
      "name": "Test Plan 6",
      "status": "active",
      "currency_code": "USDC",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDC",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 1,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1673308800,
      "created_date": 1665399015,
      "deleted_date": null
    },
    {
      "id": "sub_nmKq34DE1DJy0aX",
      "object": "subscription",
      "name": "Test Plan 1",
      "status": "active",
      "currency_code": "USDT",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDT",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 0.11,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1667635600,
      "created_date": 1664957200,
      "deleted_date": null
    },
    {
      "id": "sub_x10eG5POJ2j9AEn",
      "object": "subscription",
      "name": "Premium",
      "status": "active",
      "currency_code": "USDC",
      "currency": {
        "id": "currency_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDC",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "fiat_amount": 1.5,
      "fiat_currency_code": "USD",
      "interval": "month",
      "interval_count": 1,
      "next_payment_date": 1668124800,
      "created_date": 1665476392,
      "deleted_date": null
    }
  ],
  "meta": {
    "current_page": 1,
    "from": 1,
    "last_page": 1,
    "per_page": 50,
    "to": 8,
    "total": 8
  }
}
